{
    "name": "EvaMariaBot",
    "description": "When you going to send file on telegram channel this bot will save that in database, So you can search that easily in inline mode",
    "stack": "container",
    "keywords": [
      "telegram",
      "auto-filter",
      "filter",
      "best",
      "indian",
      "pyrogram",
      "media",
      "search",
      "channel",
      "index",
      "inline"
    ],
    "website": "https://hagadmansa.com",
    "repository": "https://github.com/Hagadmansa/EvaMaria",
    "env": {
        "BOT_TOKEN": {
            "description": "Your bot token.",
            "required": true
        },
        "API_ID": {
            "description": "Get this value from https://my.telegram.org",
            "required": true
        },
        "API_HASH": {
            "description": "Get this value from https://my.telegram.org",
            "required": true
        },
        "CHANNELS": {
            "description": "Username or ID of channel or group. This is bot database group/channel if you want to add multiple databases then Separate multiple IDs by space. make sure bot is admin in your group/channel. Give a channel id use private channel (recommended)",
            "required": false
        },
        "ADMINS": {
            "description": "Username or ID of Admins which have access to Bot's all commands. Separate multiple Admins by space.",
            "required": true
        },
        "PICS": {
            "description": "Add some telegraph link of pictures get this value from @hk_telegraph_bot on Telegram. If you want to add multiple images then Separate links by space bot will share a random image on /start.",
            "required": false
        },
        "LOG_CHANNEL": {
            "description": "Bot Logs, where bot will share his activies like new user joined, batch json file created etc. Give a channel id use private channel (recommended)",
            "required": true
        },
        "AUTH_USERS": {
            "description": "Username or ID of users to give access of inline search. Separate multiple users by space.\nLeave it empty if you don't want to restrict bot usage.",
            "required": false
        },
        "AUTH_CHANNEL": {
            "description": "ID of that channel which you want to force subscribe by your user. Make sure bot is admin in this channel. Without subscribing this channel users cannot use bot.",
            "required": false
        },
        "DATABASE_URI": {
            "description": "mongoDB URI. Get this value from https://www.mongodb.com. For more help watch this video - https://youtu.be/dsuTn4qV2GA",
            "required": true
        },
        "DATABASE_NAME": {
            "description": "Name of the database in mongoDB. For more help watch this video - https://youtu.be/dsuTn4qV2GA",
            "required": false
        },
        "COLLECTION_NAME": {
            "description": "Name of the collections. Defaults to Telegram_files. If you are using the same database, then use different collection name for each bot",
            "value": "Telegram_files",
            "required": false
        },
        "UPSTREAM_REPO": {
            "description": "Default is https://github.com/hagadmansa/EvaMaria. without this your bot will not work. Do not change if you don't know python.",
            "value": "https://github.com/hagadmansa/EvaMaria",
            "required": true
            
    },
    "addons": [],
    "buildpacks": [{
        "url": "heroku/python"
    }],
    "formation": {
        "worker": {
            "quantity": 1,
            "size": "free"
        }
    }
}
